Repository: Ekkro/PLC
Catalog: trabalhoP1/*/kbackgammon.po
Languages: fr

source: The &kbackgammon; Handbook
fr: Le manuel de &kbackgammon;

source: Developer
fr: Développeur

source: ROLES_OF_TRANSLATORS
fr: <othercredit role="translator"><firstname>Gérard</firstname><surname>Delafond</surname> <affiliation><address><email>gerard@delafond.org</email></address></affiliation><contrib>Traduction française</contrib></othercredit>

source: &kbackgammon; is a graphical backgammon program for &kde;. It supports backgammon games with other players, games against computer engines like &GNU; <application>bg</application> and even on-line games on the <ulink url="http://www.fibs.com/">First Internet Backgammon Server</ulink>.
fr: &kbackgammon; est un programme graphique de backgammon pour &kde;. Il supporte les parties de backgammon contre d'autres joueurs, contre des moteurs informatiques comme &GNU; <application>bg</application> et même les parties en ligne sur le <ulink url="http://www.fibs.com/">First Internet Backgammon Server</ulink>.

source: game
fr: jeu

source: &kbackgammon; is a graphical backgammon program. The objective of backgammon is to move your checkers off the board before your opponent does. While the rules of backgammon are moderately difficult (the most difficult part apparently being the initial positioning of the checkers), this document does not try to teach these rules: please refer to the Web, a book, or (probably best) a friend for this.
fr: &kbackgammon; est un programme graphique de backgammon. L'objectif du backgammon est de sortir vos pions du plateau avant votre adversaire. Comme les règles du backgammon sont moyennement difficiles (la phase la plus difficile étant apparemment la position initiale des pions), ce document n'essaye pas d'enseigner ces règles. Veuillez vous référer au Web, à un livre ou (probablement le mieux) à un ami pour cela.

source: &kbackgammon; offers you a graphical backgammon board that can be used almost entirely by using the mouse (although textual commands are also available and it should be possible to play backgammon without the mouse, too). Therefore, &kbackgammon; is easy to use and allows you to concentrate on the important aspects of playing backgammon.
fr: &kbackgammon; vous offre un plateau graphique de backgammon qui peut être utilisé presque entièrement à la souris (bien que des commandes texte soient aussi disponibles et il devrait donc être possible de jouer également sans souris). De ce fait, &kbackgammon; est facile à utiliser et vous permet de vous concentrer sur les aspects les plus importants du jeu de backgammon.

source: In order to play backgammon, you usually need an opponent. &kbackgammon; offers you to play against hundreds of different opponents of various strength on the <ulink url="http://www.fibs.com/">First Internet Backgammon Server</ulink>. If you prefer, you may also use the <link linkend="engine-offline">Offline Engine</link> which allows you to play against yorself or friends that are with you at your computer.
fr: Pour jouer au backgammon, vous avez habituellement besoin d'un adversaire. &kbackgammon; vous offre de jouer contre des centaines d'adversaires différents de forces diverses sur le <ulink url="http://www.fibs.com/">First Internet Backgammon Server</ulink>. Si vous préférez, vous pouvez utiliser le <link linkend="engine-offline">Moteur hors ligne</link> qui vous permet de jouer contre vous-même ou des amis qui sont avec vous près de l'ordinateur.

source: In the near future &kbackgammon; will allow you to play against <link linkend="engine-gnubg">&GNU; Backgammon</link>, which is a powerful backgammon program that usually runs without a graphical frontend. It plays on <acronym>FIBS</acronym> with a rating of about 2000 (which is quite high).
fr: Dans un futur proche, &kbackgammon; vous permettra de jouer contre <link linkend="engine-gnubg">&GNU; Backgammon</link>, qui est un programme puissant de backgammon qui fonctionne habituellement sans interface graphique. Il joue sur <acronym>FIBS</acronym> avec une valeur d'environ 2000 (ce qui est très haut).

source: Additionally, plans are on the way that will allow games over the Internet between two &kbackgammon; programs (and their respective users). Finally, the architecture of &kbackgammon; is quite open and it is possible to include support for other engines easily (if you are interested in this, please contact the author).
fr: De plus, il y a un projet de permettre des parties sur l'Internet entre deux programmes de &kbackgammon; (et leurs utilisateurs respectifs). Finalement, l'architecture de &kbackgammon; est assez ouverte et il est possible d'inclure le support pour d'autres moteurs facilement (si vous êtes intéressé, veuillez contacter l'auteur).

source: How to use the Board
fr: Comment utiliser le plateau

source: &kbackgammon; is centered around a graphical backgammon board. This board consists of the checkers, the dice, and the cube. All these game elements can be conviniently manipulated with the mouse.
fr: &kbackgammon; est centré autour d'un plateau graphique de backgammon. Ce plateau consiste en des pions, le dé et le videau (dé spécial). Tous ces éléments de jeu se manipulent facilement à la souris.

source: The following image shows a typical game situation with the white player moving from 1 to 24 and the black player moving from 24 to 1. Currently, the white player owns the cube and has just rolled 3 and 4.
fr: L'image suivante montre une situation de jeu typique avec le joueur des blancs avançant de 1 à 24 et le joueur des noirs avançant de 24 à 1. Actuellement, les blancs ont le videau et viennent de lancer 3 et 4.

source: The backgammon board
fr: Le plateau de backgammon

source: The Board
fr: Le plateau

source: If it is their turn, players can roll the dice by double clicking on the squares representing the dice or by using the corresponding menu entry or toolbar icon (if the toolbar is visible and rolling has been included in the toolbar).
fr: Quand c'est son tour, le joueur peut lancer les dés en cliquant sur les carrés les représentant ou en utilisant le menu correspondant dans la barre d'outils ou la barre d'icônes (si la barre d'outils est visible et que le lancement des dés y a été inclus).

source: If they own the cube, players can double the cube by either double clicking on the square representing the cube or by using the corresponding menu entry or toolbar icon (if the toolbar is visible and the cube has been included in the toolbar).
fr: S'il a le videau, le joueur peut doubler soit en double-cliquant sur le carré qui représente le videau, soit en utilisant l'entrée de menu correspondante ou l'icône de la barre d'outils (si la barre d'outils est visible et que le videau y a été inclus).

source: If it is their turn to move, players can move checkers by clicking on them and moving the mouse pointer to the desired location (while holding the mouse button continuously pressed). This is called dragging the checker. Depending on the selection made in the current <link linkend="engines">engine's</link> <link linkend="prefs">configuration</link>, the move will be finished once the maximum number of checkers has been moved (this may be anywhere between 1 and 4 checkers, although it will usually be 2 checkers).
fr: Si c'est son tour, le joueur peut déplacer les pions en cliquant dessus et en déplaçant le pointeur de la souris vers l'emplacement désiré (en maintenant le bouton enfoncé pendant le trajet). Ceci s'appelle tirer un pion. En fonction de la sélection faite dans <link linkend="prefs">configuration</link> du <link linkend="engines">moteur</link>, le mouvement sera terminé une fois que le nombre de maximum de pions a été bougé (ce peut être entre 1 et 4 pions, bien que ce soit habituellement 2).

source: In addition to dragging the checkers, the board offers a feature called <firstterm>short move feature</firstterm>. If this has been enabled in the board's configuration menu, checkers can be moved by simply clicking on them. The board will then automatically make the shortest move possible away from the current field. If the short move feature <link linkend="prefs">is enabled</link>, it may be set to single or double click. This option is very useful for users of touchpads that are sometimes difficult to use for dragging.
fr: En plus de tirer les pions, le plateau offre une fonctionnalité nommée <quote>petits mouvements</quote>. Si ceci est activé dans le menu de configuration du plateau, les pions peuvent être déplacés en cliquant simplement dessus. Le plateau fera automatiquement le mouvement le plus court possible à partir de la position courante. Si les petits mouvements <link linkend="prefs">sont activés</link>, ils peuvent être réglés sur le simple ou le double clic. Cette option est très utile pour les utilisateurs de dalles tactiles qui ont souvent des difficultés pour le glisser-déposer.

source: Finally, the board has a certain smartness: it will only accept moves that are allowed (based on the current dice). While the <link linkend="engine-offline">offline engine</link> allows this to be switched off (for the <guilabel>Edit Mode</guilabel>), this is usually very helpful for unexperienced users (and advanced players will probably never notice this). This featue can also be used to cancel a move in progress: just drop it over an illegal field.
fr: Enfin, le plateau a certaines gentillesses&nbsp;: il n'acceptera que les mouvements autorisés (en fonction du dé). Alors que le <link linkend="engine-offline">moteur hors ligne</link> autorise l'inactivation de cette fonction (en <guilabel>mode édition</guilabel>), ce qui est très utile pour les joueurs inexpérimentés (les joueurs avancés ne verront sans doute jamais cette fonctionnalité). Cette fonctionnalité peut aussi servir à annuler un mouvement en cours&nbsp;: lâchez simplement le pion sur un champ interdit.

source: Backgammon Engines
fr: Moteurs Backgammon

source: &kbackgammon; is built around the backgammon board, which doesn't know anything about how to play backgammon. The whole infrastructure (rolling the dice, &etc;) that allows backgammon games is handled by backgammon engines.
fr: &kbackgammon; est construit autour du plateau de backgammon, qui ne sait rien de la manière de jouer au backgammon. La totalité de l'infrastructure (lancer les dés, &etc;) qui permet de jouer est gérée par les moteurs de backgammon.

source: The Offline Engine
fr: Le moteur non connecté

source: The offline engine allows you to play against yourself, or probably more fun, another person sitting with you.
fr: Le moteur de jeu hors ligne vous permet de jouer contre vous-même, ou, ce qui est probablement plus amusant, contre une autre personne assise à votre côté.

source: The <acronym>FIBS</acronym> Engine
fr: Le moteur <acronym> FIBS</acronym>

source: <acronym>FIBS</acronym> is the <quote>First Internet Backgammon Server</quote>, a 24-hour international online community of backgammon players of all ages and experience from Beginner to Experts.
fr: L'abréviation <acronym>FIBS</acronym> désigne le <quote>First Internet Backgammon Server</quote>, une communité de joueurs de backgammon de tous âges et de tous niveaux (du débutant à l'expert) en ligne 24 heures sur 24.

source: As well as playing the game, <acronym>FIBS</acronym> allows you to save games, chat with other players, and has a complex rating system.
fr: <acronym>FIBS</acronym> vous permet non seulement de jouer, mais également d'enregistrer des parties et de discuter avec d'autres joueurs, et a un système de notation des joueurs élaboré.

source: There is also a large <ulink url="http://www.fibs.com/">website</ulink> well worth some of your time, if you are a backgammon fan.
fr: Il y a également un <ulink url="http://www.fibs.com/">site web</ulink> qui vaut le détour si vous êtes un passionné de backgammon.

source: The &GNU; Backgammon Engine
fr: Le moteur &GNU; Backgammon

source: The GNUbg engine does not yet exist (although it already has an entry in the <guilabel>Engine</guilabel> menu). Therefore, the remainder of this section should be taken with a grain of salt.
fr: Le moteur GNUbg n'existe pas encore (bien que ce soit déjà une élément du menu <guilabel>Moteur</guilabel>). De ce fait, le reste de cette section doit être pris avec réserve.

source: Use of the GNUbg engine requires a working installation of the actual GNUbg program. &kbackgammon; then starts GNUbg in the background and communicates with it. All this is transparent to the user (&ie; it is hidden from the user) and all interaction with GNUbg is through the &GUI; elements of &kbackgammon;.
fr: L'utilisation du moteur GNUbg suppose que le programme GNUbg est installé et en état de marche. &kbackgammon; démarre alors GNUbg en tâche de fond et communique avec lui. Tout cela est transparent pour l'utilisateur (&cad; caché à l'utilisateur) et toutes les interactions avec GNUbg se font par le biais des éléments graphiques de &kbackgammon;.

source: If there are other enhancements that can help using GNUbg from &kbackgammon;, please contact the author of &kbackgammon; (or better: send a patch). Some of the more advanced features will probably be position analysis and save/restore functions. However, playing is the most pressing issue.
fr: S'il y a d'autres perfectionnements qui peuvent aider à utiliser GNUbg depuis &kbackgammon;, veuillez contacter l'auteur de &kbackgammon;, (ou mieux, envoyez un additif). Certaines des fonctionnalités les plus avancées seront probablement l'analyse de position et les fonctions d'enregistrement/restauration. Cependant, pouvoir jouer est ce qu'il y a de plus pressé.

source: The one thing that will never happen is a combination of the GNUbg and the <acronym>FIBS</acronym> engine! Using computer programs to enhance user ratings is cheating!
fr: Une fonctionnalité qui ne verra jamais le jour est une combinaison des moteurs GNUbg et <acronym>FIBS</acronym>, car utiliser un programme d'ordinateur pour améliorer vos performances serait de la triche.

source: Game options
fr: Options du jeu

source: The options to &kbackgammon; are set by selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure KBackgammon...</guimenuitem> </menuchoice> from the menubar. This will bring up a dialog box.
fr: Vous pouvez configurer les options de &kbackgammon; en choisissant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Configurer KBackgammon...</guimenuitem></menuchoice> dans la barre de menus, ce qui ouvre une boîte de dialogue.

source: Commands/Keyboard Shortcuts
fr: Raccourcis clavier pour les commandes

source: The following sections briefly describe each menubar option.
fr: La section suivante décrit brièvement chaque option de barre de menus.

source: <guimenu>File</guimenu> Menu
fr: Menu <guimenu>Fichier</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New Game</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Nouvelle partie</guimenuitem>

source: Start a new game
fr: Démarre une nouvelle partie

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Load Game</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Charger une partie</guimenuitem>

source: Load a previously saved game.
fr: Charge une partie enregistrée au préalable.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Save Game</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Enregistrer une partie</guimenuitem>

source: Save a game so you can finish or replay it later.
fr: Enregistre une partie de manière à pouvoir la terminer ou la rejouer plus tard.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Print...</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Imprimer...</guimenuitem>

source: Print a picture of the board.
fr: Imprime une image du plateau de jeu.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Quitter</guimenuitem>

source: <action>Quit</action> and close &kbackgammon;
fr: <action>Sort de</action> &kbackgammon;

source: <guimenu>Move</guimenu> Menu
fr: Menu <guimenu>Coup</guimenu>

source: <guimenu>Move</guimenu> <guisubmenu>Engine</guisubmenu>
fr: <guimenu>Coup</guimenu> <guisubmenu>Moteur</guisubmenu>

source: Choose from the various game engines here.
fr: Permet de choisir l'un des moteurs de jeu.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap> </keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap> </keycombo> </shortcut> <guimenu>Coup</guimenu> <guimenuitem>Annuler</guimenuitem>

source: Undo the last move you made.
fr: Annule le dernier coup joué.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Coup</guimenu> <guimenuitem>Refaire</guimenuitem>

source: If you have previously undone a move, you can redo it here.
fr: Permet de rejouer un coup annulé précédemment.

source: <guimenu>Move</guimenu> <guimenuitem>Redisplay</guimenuitem>
fr: <guimenu>Coup</guimenu> <guimenuitem>Réafficher</guimenuitem>

source: Redraw the board.
fr: Redessine le plateau de jeu.

source: As you may expect, roll the dice.
fr: Lance les dés, comme on pouvait s'en douter.

source: <guimenu>Move</guimenu> <guimenuitem>Done Moving</guimenuitem>
fr: <guimenu>Coup</guimenu> <guimenuitem>Coup effectué</guimenuitem>

source: Let the other player know you have finished moving.
fr: Signale à l'autre joueur que vous avez fini votre coup.

source: <guimenu>Move</guimenu> <guimenuitem>Double Cube</guimenuitem>
fr: <guimenu>Coup</guimenu> <guimenuitem>Videau</guimenuitem>

source: <guimenu>Command</guimenu> Menu
fr: Menu <guimenu>Commande</guimenu>

source: Information missing...
fr: Informations manquantes...

source: <guimenu>Command</guimenu> <guimenuitem>New Game</guimenuitem>
fr: <guimenu>Commande</guimenu> <guimenuitem>Nouvelle partie</guimenuitem>

source: <guimenu>Command</guimenu> <guimenuitem>Edit Mode</guimenuitem>
fr: <guimenu>Commande</guimenu> <guimenuitem>Mode édition</guimenuitem>

source: <guimenu>Command</guimenu> <guimenuitem>Swap Colors</guimenuitem>
fr: <guimenu>Commande</guimenu> <guimenuitem>Interchanger les couleurs</guimenuitem>

source: <guimenu>Settings</guimenu> Menu
fr: Menu <guimenu>Configuration</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap> </keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap> </keycombo> </shortcut> <guimenu>Configuration</guimenu> <guimenuitem>Afficher la barre de menus</guimenuitem>

source: <action>Toggle on and off the menubar</action>.
fr: <action>(Dés)active la barre de menus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Afficher la barre d'outils</guimenuitem>

source: Toggle on and off the toolbar
fr: (Dés)active la barre d'outils

source: <guimenu>Settings</guimenu> <guimenuitem>Show Command Line</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Afficher une ligne de commande</guimenuitem>

source: Toggle on and off the Command Line.
fr: (Dés)active la ligne de commande.

source: <guimenu>Help</guimenu> Menu
fr: Menu <guimenu>Aide</guimenu>

source: Default Key Bindings
fr: Les raccourcis clavier par défaut

source: The following tables show you the default key bindings of &kbackgammon;.
fr: Le tableau suivant vous montre les raccourcis clavier par défaut de &kbackgammon;.

source: Key bindings
fr: Raccourcis clavier

source: Key Combo
fr: Combinaison de touches

source: Print Game
fr: Imprime le jeu

source: Quit &kbackgammon;
fr: Quitte &kbackgammon;

source: Help Contents
fr: Contenu de l'aide

source: Whats This Help
fr: L'aide Qu'est-ce que c'est&nbsp;?

source: Undo move
fr: Annuler le coup

source: Redo previously undone move
fr: Refaire un mouvement précédemment annulé

source: These key bindings can be changed by selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Key Bindings</guimenuitem> </menuchoice> from the menubar.
fr: Ces raccourcis clavier peuvent être changés en sélectionnant <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Raccourcis clavier...</guimenuitem> </menuchoice> dans la barre de menus.

source: Credits and License
fr: Remerciements et licence

source: Program copyright 1999-2000 Jens Hoefkens <email>jens@hoefkens.com</email>
fr: Programme copyright 1999-2000 Jens Hoefkens <email>jens@hoefkens.com</email>

source: CREDIT_FOR_TRANSLATORS
fr: <para>Traduction française par Gérard Delafond<email>gerard@delafond.org</email></para>

source: How to obtain &kbackgammon;
fr: Comment obtenir &kbackgammon;

source: The home page of &kbackgammon; is located at <ulink url="http://backgammon.sourceforge.net/">http://backgammon.sourceforge.net</ulink>. It will usually contain the most up-to-date informationon the program available.
fr: La page de référence de &kbackgammon; se trouve à <ulink url="http://backgammon.sourceforge.net/">http://backgammon.sourceforge.net</ulink>. Elle contiendra habituellement les informations les plus à jour disponibles sur le programme.

source: Compilation and Installation
fr: Compilation et installation
