Repository: Ekkro/PLC
Catalog: trabalhoP1/*/kfouleggs.po
Languages: fr

source: The &kfouleggs; Handbook
fr: Le manuel de &kfouleggs;

source: Developer
fr: Développeur

source: Reviewer
fr: Relecture

source: ROLES_OF_TRANSLATORS
fr: <othercredit role="translator"><firstname>Eric</firstname><surname>Bischoff</surname><affiliation><address><email>e.bischoff@noos.fr</email></address></affiliation><contrib>Traduction française</contrib></othercredit>

source: &kfouleggs; is a clone of the Japanese PuyoPuyo game for the K Desktop Environment.
fr: &kfouleggs; est un clone pour l'environnement de bureau K du jeu japonais PuyoPuyo.

source: &kfouleggs; is a clone of the Japanese PuyoPuyo game, with advanced features such as multiplayer games against human or <acronym>AI</acronym>, and network play. If you have played <application>Tetris</application>, or one of its many clones, you will find &kfouleggs; easy to learn.
fr: &kfouleggs; est un clone du jeu japonais PuyoPuyo, avec des fonctionnalités avancées comme les parties à plusieurs joueurs humains ou artificiels, et le jeu en réseau. Si vous avez joué à <application>Tetris</application>, ou à un de ses nombreux clones, alors vous trouverez &kfouleggs; facile à apprendre.

source: Game Play
fr: Déroulement de la partie

source: Starting a New Game
fr: Commencer une nouvelle partie

source: When you start &kfouleggs;, just click on the <guibutton>Press to start</guibutton> button, or select <guimenuitem>New</guimenuitem> from the <guimenu>Game</guimenu> menu at any time to start a new game.
fr: Quand vous démarrez &kfouleggs;, appuyez simplement quand vous le désirez sur le bouton <guibutton>Appuyez pour commencer</guibutton>, ou choisissez <guimenuitem>Nouveau</guimenuitem> depuis le menu <guimenu>Jeu</guimenu> pour démarrer une nouvelle partie.

source: Aim of the Game
fr: But du jeu

source: The aim of the game is to achieve the highest score possible by moving the falling tiles in such a way that tiles of the same color are adjacent, and disappear. The more tiles you remove, the higher your score.
fr: Le but du jeu est d'obtenir le score le plus élevé possible en déplaçant les pièces qui tombent de telle manière que les pièces d'une même couleur soient adjacentes et disparaissent. Plus vous supprimez de pièces, plus votre score est élevé.

source: Playing the Game
fr: Comment jouer

source: Use the <keycap>Left</keycap> and <keycap>Right</keycap> arrow keys to move the falling tile in the relevant direction, and the <keycap>Up</keycap> arrow and <keycap>Return</keycap> keys to rotate the tile left and right respectively. The <keycap>Shift</keycap> key drops the tile down one line, and the <keycap>Down</keycap> key drops the tile all the way down - use it as a way of saving time.
fr: Utilisez les touches fléchées <keycap>Gauche</keycap> et <keycap>Droite</keycap> pour déplacer la pièce qui tombe dans la direction souhaitée, et les touches <keycap>Haut</keycap> et <keycap>Entrée</keycap> pour faire tourner la pièce vers la gauche et vers la droite respectivement. La touche <keycap>Majuscule</keycap> fait tomber la pièce d'une ligne, et la touche <keycap>Bas</keycap> fait tomber la pièce jusqu'en bas - utilisez-la pour gagner du temps.

source: All of these key bindings can be customized by selecting <guimenuitem>Configure key bindings</guimenuitem> from the <guimenu>Settings</guimenu> menu.
fr: Toutes les assignations de touches peuvent être réglées en choisissant <guimenuitem>Raccourcis clavier</guimenuitem> dans le menu <guimenu>Configuration</guimenu>.

source: If two or more tiles of the same color come to rest horizontally or vertically next to each other, they become <quote>glued</quote>. If four or more pieces of the same color come to be <quote>glued</quote>, they disppear, and any pieces above them fall down according to the law of gravity ;-). If this causes four or more pieces to become <quote>glued</quote>, then they will also disappear, and so on.
fr: Si deux pièces au moins de la même couleur s'arrêtent en se retrouvant alignées horizontalement ou verticalement, elles deviennent <quote>collées</quote>. Si quatre pièces au moins de la même couleur sont <quote>collées</quote> ensemble, elles disparaissent, et d'éventuelles pièces se trouvant au-dessus tombent en accord avec la loi de la pesanteur ;-). Si par voie de conséquence quatre pièces ou plus se retrouvent <quote>collées</quote>, elles disparaîtront elles aussi, et ainsi de suite.

source: Every time you remove 100 tiles, you advance to the next level, where the tiles fall faster, and the game is more difficult.
fr: Chaque fois que vous avez supprimé 100 pièces, vous passez au prochain niveau, où les pièces tombent plus vite, et où le jeu est plus difficile.

source: The game ends when the central column fills with tiles, and no more can fall.
fr: La partie se termine quand la colonne centrale est remplie de pièces, et que plus aucune pièce ne peut tomber.

source: The Game Screen
fr: L'écran de jeu

source: &kfouleggs; in Action
fr: &kfouleggs; en action

source: A quick explanation of what each of the parts of the game screen are for...
fr: Une explication rapide de la fonction de chacune des parties de l'écran de jeu...

source: Along the left hand side, from top to bottom:
fr: Du côté gauche, de haut en bas&nbsp;:

source: Shows your current score.
fr: Affiche votre score actuel.

source: Keeps track of the number of times you have removed each amount of consecutive Puyos. For example, every time you remove one set of pieces, the counter for <guilabel>0</guilabel> increments, every time two sets of pieces are removed in one go, the counter for <guilabel>1</guilabel> increments, and so on. The final counter records any removals of more than three sets of pieces.
fr: Compte le nombre de fois que vous supprimez un certain nombre d'alignements de puyos. Par exemple, chque fois que vous supprimez un ensemble de pièces, le compteur pour <guilabel>0</guilabel> augmente, chaque fois que vous supprimez deux ensembles de pièces d'un seul coup, le compteur pour <guilabel>1</guilabel> augmente, et ainsi de suite. Le dernier compteur enregistre tout retrait de plus de trois ensembles de pièces.

source: Level
fr: Niveau

source: Shows the number of the level you are currently on. The first, easiest level is level one, progressing to the last, hardest level, 20.
fr: Affiche le numéro du niveau dans lequel vous êtes actuellement. Les niveaux vont en difficulté croissante du plus simple, le niveau 1, jusqu'au plus dur, le niveau 20.

source: In the center is the area where the action takes place. The tiles fall through the rectangle (whose properties can be changed in <menuchoice><guimenu>>Settings</guimenu><guimenuitem>Configure KFoulEggs</guimenuitem><guilabel>Game</guilabel> </menuchoice>, see <xref linkend="game-config"/>) until reaching the bottom. The two small black rectangles under the main one are the tile's <quote>shadow</quote> which show where it will land. You can toggle the tile's shadow in <xref linkend="game-config"/>.
fr: Au centre se trouve la zone dans laquelle se déroule l'action. Les pièces tombent à l'intérieur du rectangle (dont les propriétés peuvent être modifiées dans <menuchoice><guimenu>Configuration</guimenu><guimenuitem>Configurer KFoulEggs</guimenuitem><guilabel>Partie</guilabel></menuchoice>, voir <xref linkend="game-config"/>) jusqu'à ce qu'elles en atteignent le fond. Les deux petits rectangles noirs sous le rectangle principal sont l'<quote>ombre</quote> de la pièce qui vous indique l'emplacement vers lequel elle se dirige. Vous pouvez activer ou désactiver l'ombre de la pièce dans <xref linkend="game-config"/>.

source: On the right hand side, the <guilabel>Next tile</guilabel> box shows what the next tile to fall will be, if you have enabled it in <xref linkend="game-config"/>.
fr: Sur le côté droit, la case <guilabel>Pièce suivante</guilabel> affiche quelle sera la prochaine pièce à tomber, si vous avez activé cette possibilité dans <xref linkend="game-config"/>.

source: &kfouleggs; Configuration and Default Keybindings
fr: Réglages de &kfouleggs; et assignations de touches par défaut

source: Configuring Gameplay
fr: Configuration du jeu

source: The &kfouleggs; configuration is accessed from <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure KFoulEggs</guimenuitem></menuchoice>. The options are as follows:
fr: Vous pouvez accéder aux réglages de &kfouleggs; en choisissant <menuchoice><guimenu>Configuration</guimenu><guimenuitem>Configurer KFoulEggs</guimenuitem></menuchoice>. Vous pouvez régler les paramètres suivants&nbsp;:

source: Game Configuration
fr: Configuration de la partie

source: Initial Level
fr: Niveau de départ

source: Set the level which you will play at startup, from 1 (easiest) to 20 (hardest). Default is level one.
fr: Définit le niveau auquel vous jouerez au démarrage, de 1 (le plus facile) à 20 (le plus dur). Par défaut, le jeu démarre au niveau 1.

source: Show tile's shadow
fr: Afficher l'ombre des pièces

source: If checked, a shadow is placed beneath the game board showing where the piece will fall.
fr: Si cette case est cochée, une ombre en-dessous du terrain de jeu indique où la pièce va tomber.

source: Show next tile
fr: Afficher la pièce suivante

source: If checked, shows the next tile that will fall onto the game board.
fr: Si cette case est cochée, la prochaine pièce à tomber sur le terrain est affichée.

source: Appearance Configuration
fr: Configuration de l'apparence

source: Block Size
fr: Taille des blocs

source: Sets the size of the falling blocks.
fr: Règle la taille des blocs qui tombent.

source: Enable animations
fr: Activer les animations

source: If checked, pieces gluing are shown with an animation.
fr: Si cette case est cochée, les pièces qui se collent sont mises en évidence grâce à une animation.

source: Fade Strength
fr: Intensité du fondu

source: Controls the fade balance between the desktop background and the &kfouleggs; background. A setting of zero makes the &kfouleggs; background completely transparent, and a setting of one makes the &kfouleggs; background completely opaque.
fr: Control le niveau de transparence entre le fond de bureau et le fond de &kfouleggs;. Un réglage de zéro rend le fond de &kfouleggs; complètement transparent, et un réglage de un rend le fond de &kfouleggs; complètement opaque.

source: Fade Colour
fr: Couleur du fondu

source: Displays a dialog allowing you to choose the colour of the &kfouleggs; background.
fr: Affiche un dialogue permettant de choisir la couleur du fond de &kfouleggs;.

source: Highscore Configuration
fr: Configuration du Panthéon

source: Nickname
fr: Surnom

source: Displays your current nickname and allows you to change it.
fr: Affiche votre surnom actuel et vous permet de le changer.

source: Comment
fr: Commentaire

source: A comment about yourself. You choose...
fr: Un commentaire à votre sujet. À vous de voir...

source: World-wide highscores enabled
fr: Panthéon mondial activé

source: If checked, &kfouleggs; connects to the highscore webserver to view &kfouleggs; highscores from around the world.
fr: Si cette case est cochée, &kfouleggs; se connectera au serveur web des meilleurs scores pour afficher les meilleures scores mondiaux à &kfouleggs;.

source: Default Keybindings
fr: Assignations de touches par défaut

source: The default keybindings for &kfouleggs; in one-player mode are as follows:
fr: Les assignations de touche par défaut de &kfouleggs; en mode un joueur sont réglées comme suit&nbsp;:

source: Rotate Left
fr: Tourner à gauche

source: Up Arrow
fr: Flèche vers le haut

source: Rotate Right
fr: Tourner à droite

source: Return
fr: Entrée

source: Move Left
fr: Déplacer à gauche

source: Left Arrow
fr: Flèche vers la gauche

source: Move Right
fr: Déplacer à droite

source: Right Arrow
fr: Flèche vers la droite

source: Drop Down
fr: Laisser tomber

source: Down Arrow
fr: Flèche vers le bas

source: Drop One Line
fr: Laisser tomber d'une ligne

source: Shift
fr: Majuscule

source: Multiplayer and Network Play
fr: Jouer à plusieurs et en réseau

source: General Information
fr: Informations générales

source: &kfouleggs; supports two local multiplayer types - Human vs. Human and Human vs. Computer. To play either of these, select it from the <guimenu>Multiplayers</guimenu> menu.
fr: &kfouleggs; permet de jouer de manière locale à plusieurs de deux façons&nbsp;: humain contre humain et humain contre l'ordinateur. Pour jouer dans l'un de ces modes, choisissez-le dans le menu <guimenu>Multijoueurs</guimenu>.

source: Local Multiplayer Games
fr: Jouer à plusieurs de manière locale

source: In Human vs. Human or Human vs. Computer mode, two gameboards are shown, one for the first player and one for the second. Each has its own <guilabel>Score</guilabel>, <guilabel>Removed</guilabel> and <guilabel>Level</guilabel> indicator. The keys for the first human player become, by default:
fr: En mode humain contre humain ou humain contre ordinateur, deux terrains de jeu sont affichés, un pour le premier joueur et l'autre pour le second. Chacun a ses propres indicateurs de <guilabel>Score</guilabel>, <guilabel>Enlevées</guilabel> et <guilabel>Niveau</guilabel>. Les touches pour le premier joueur humain deviennent, par défaut&nbsp;:

source: Space
fr: Espace

source: The keys for the second human player are the same as for the player in single player mode.
fr: Les touches pour le second joueur humain sont les mêmes qu'en mode à un seul joueur.

source: To return to single player mode, select <guimenu>Multiplayers</guimenu> and <guimenuitem>Single Human</guimenuitem>.
fr: Pour revenir en mode à un seul joueur, choisissez <guimenu>Multijoueurs</guimenu> <guimenuitem>Humain seul</guimenuitem>.

source: Network Multiplayer Games
fr: Jeu en réseau à plusieurs

source: Multiplayer network games are set up by selecting <menuchoice><guimenu>Multiplayers</guimenu> <guimenuitem>More...</guimenuitem></menuchoice>
fr: Les parties à plusieurs en réseau sont mis en place en choisissant <menuchoice><guimenu>Multijoueurs</guimenu><guimenuitem>Plus...</guimenuitem></menuchoice>

source: Multiplayer games of &kfouleggs; use the model of a hosted game which other players join.
fr: Les parties à plusieurs de &kfouleggs; utilisent le modèle d'une partie hôte que d'autres joueurs rejoignent.

source: Hosting a game
fr: Héberger une partie

source: To host a game, select <guilabel>Create a network game</guilabel> in the Multiplayers option dialog, set the port you want to use, and click on the <guibutton>Next</guibutton> button.You then have the option of changing local players' settings, if there are more than one local players. Clicking the <guibutton>Finish</guibutton> button advances the dialog to the waiting for clients stage. When enough clients have joined, <guibutton>Start Game</guibutton> starts the multiplayer game.
fr: Pour héberger une partie, choisissez <guilabel>Créer un jeu en réseau</guilabel> dans la boîte de dialogue des options de jeu à plusieurs, réglez le port réseau que vous désirez utiliser, et cliquez sur le bouton <guibutton>Suivant</guibutton>. Vous pouvez alors changer les réglages des joueurs locaux, s'il y a plus d'un joueur sur place. En cliquant sur le bouton <guibutton>Terminer</guibutton>, vous passez en phase d'attente de clients. Quand suffisament de clients se sont inscrits, <guibutton>Partie</guibutton> démarre le jeu à plusieurs.

source: Joining a game
fr: S'inscrire à une partie

source: To join a game, select <guimenuitem>Join a network game</guimenuitem> in the Multiplayers option dialog. Select the host (<guilabel>Server address</guilabel>) and <guilabel>Port</guilabel> you want to connect to.
fr: Pour s'inscrire à une partie, choisissez <guimenuitem>Se joindre à un jeu en réseau</guimenuitem> dans la boîte de dialogue des options de jeu à plusieurs. Choisissez la machine hôte (<guilabel>Adresse du serveur </guilabel>) et le port <guilabel>Port</guilabel> auxquels vous désirez vous connecter.

source: Make sure that the port you set when joining a game is the same as the port that was set by the host of the game!
fr: Assurez-vous que le port que vous utilisez quand vous vous inscrivez à une partie et le même que celui qui a été choisi par l'hébergeur du jeu&nbsp;!

source: Clicking <guibutton>Next</guibutton> takes you to the <guilabel>Local players settings</guilabel> dialog (see above), and then <guibutton>Finish</guibutton> connects to the remote game. The game starts when the host chooses - the client has no choice.
fr: En cliquant sur <guibutton>Suivant</guibutton>, vous vous retrouvez dans la boîte de dialogue <guilabel>Configuration des joueurs locaux</guilabel> (voir plus haut), et le bouton <guibutton>Terminer</guibutton> vous connecte au jeu distant. Le jeu démarre quand l'hébergeur en décide ainsi - le client n'a pas de choix.

source: Command Reference
fr: Liste des commandes

source: The Main &kfouleggs; window
fr: La fenêtre principale de &kfouleggs;

source: The <guimenu>Game</guimenu> Menu
fr: Le menu <guimenu>Jeu</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Nouveau</guimenuitem>

source: Starts a new game.
fr: Démarre une nouvelle partie.

source: <shortcut> <keycombo><keycap>P</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
fr: <shortcut> <keycombo><keycap>P</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses the game
fr: Gèle la partie

source: <shortcut> <keycombo><keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores...</guimenuitem>
fr: <shortcut> <keycombo><keycap>H</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Meilleurs scores...</guimenuitem>

source: Displays the high scores.
fr: Affiche la liste des scores.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Quitter</guimenuitem>

source: <action>Quits</action> &kfouleggs;
fr: <action>Sort de</action> &kfouleggs;

source: The <guimenu>Multiplayers</guimenu> Menu
fr: Le menu <guimenu>Multijoueurs</guimenu>

source: <guimenu>Multiplayers</guimenu> <guimenuitem>Single Human</guimenuitem>
fr: <guimenu>Multijoueurs</guimenu> <guimenuitem>Humain seul</guimenuitem>

source: Sets the multiplayer mode to single player
fr: Passe du mode à plusieurs joueurs en mode à un seul joueur

source: <guimenu>Multiplayers</guimenu> <guimenuitem>Human vs Human</guimenuitem>
fr: <guimenu>Multijoueurs</guimenu> <guimenuitem>Humain contre humain</guimenuitem>

source: Sets the multiplayer mode to two player with two human players.
fr: En mode à plusieurs joueurs, passe à deux joueurs humains.

source: <guimenu>Multiplayers</guimenu> <guimenuitem>Human vs Computer</guimenuitem>
fr: <guimenu>Multijoueurs</guimenu> <guimenuitem>Humain contre ordinateur</guimenuitem>

source: Sets the multiplayer mode to two player with one human and one computer player.
fr: En mode à plusieurs joueurs, pas à deux joueurs dont un humain plus l'ordinateur.

source: <guimenu>Multiplayers</guimenu> <guimenuitem>More...</guimenuitem>
fr: <guimenu>Multijoueurs</guimenu> <guimenuitem>Plus...</guimenuitem>

source: Displays the multiplayer options dialog.
fr: Affiche la boîte de dialogue des options de jeu à plusieurs.

source: The <guimenu>Settings</guimenu> Menu
fr: Le menu <guimenu>Configuration</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Configuration</guimenu> <guimenuitem>Afficher la barre de menu</guimenuitem>

source: <action>Shows or hides the Menubar.</action>To return the menubar, right-click anywhere on the gameboard and select <guimenuitem>Show Menubar</guimenuitem>.
fr: <action>Affiche ou cache la barre de menus.</action> Pour faire réapparaître la barre de menus, cliquez avec le &BDS; n'importe où sur le terrain de jeu et choisissez <guimenuitem>Afficher la barre de menus</guimenuitem>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Key Bindings</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Raccourcis clavier...</guimenuitem>

source: Displays a standard &kde; key bindings configurator.
fr: Affiche le logiciel standard de configuration des raccourcis clavier de &kde;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kfouleggs;</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer &kfouleggs;</guimenuitem>

source: <action>Displays/changes</action> the &kfouleggs; configuration.
fr: <action>Affiche/change</action> les réglages de &kfouleggs;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure AI...</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configuration de l'IA</guimenuitem>

source: Displays the &kfouleggs; <acronym>AI</acronym> Configurator
fr: Affiche le dialogue de configuration de &kfouleggs; lorsqu'il est joué par l'ordinateur.

source: The <guimenuitem>Help</guimenuitem> Menu
fr: Le menu <guimenuitem>Aide</guimenuitem>

source: Credits and License
fr: Remerciements et licence

source: Program core engine copyright 1995 Eirik End <email></email>
fr: Moteur de base copyright 1995 Eirik End <email></email>

source: Program copyright 1996-2001 Nicolas Hadacek <email>hadacek@kde.org</email>
fr: Programme copyright 1996-2001 Nicolas Hadacek <email>hadacek@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
fr: <para>Traduction française par Éric Bischoff <email>e.bischoff@noos.fr</email></para>

source: How to obtain &kfouleggs;
fr: Comment obtenir &kfouleggs;

source: Compilation and Installation
fr: Compilation et installation

source: Should you run into problems please report them to the &kde; mailing list, or the program maintainer, Nicolas Hadacek, at <email>hadacek@kde.org</email>.
fr: Si vous rencontrez des problèmes, veuillez les rapporter à la liste de discussion de &kde;, ou au mainteneur du programme, Nicolas Hadacek, à l'adresse <email>hadacek@kde.org</email>.
