Repository: Ekkro/PLC
Catalog: trabalhoP1/*/kjezz.po
Languages: fr

source: The &kjezz; Handbook
fr: Le manuel de &kjezz;

source: Reviewer
fr: Relecture

source: ROLES_OF_TRANSLATORS
fr: <othercredit role="translator"><firstname>Éric</firstname><surname>Bischoff</surname><affiliation><address><email>e.bischoff@noos.fr</email></address></affiliation><contrib>Traduction française</contrib></othercredit>

source: &kjezz; is a ball game for &kde;.
fr: &kjezz; est un jeu de balle pour &kde;.

source: How To Play
fr: Comment jouer

source: &kjezz; is played on a field, surrounded by a wall, with two or more balls that move about in the field bouncing off of the walls.
fr: &kjezz; se joue dans un terrain entouré d'un mur, avec deux balles ou plus qui avancent dans le terrain en rebondissant sur les murs.

source: Walls are a darker color while the active areas of the field are a lighter color.
fr: Les murs sont d'une couleur sombre tandis que les parties actives du terrain sont dans une couleur plus claire.

source: The size of the active area of the field is decreased by making new walls that enclose areas without balls in them. To complete a level, the player must decrease the size of the active field by at least 75&percnt; within the time allowed.
fr: La taille de la partie active du terrain diminue lorsqu'on construit de nouveaux murs qui contiennent des zones sans balles. Pour passer au niveau suivant, vous devez diminuer la taille de la partie active d'au moins 75&percnt; dans le temps imparti.

source: With each new level, another ball is added to the field, and the player is given one more life than in the level before. The time allotted to complete the level is also increased.
fr: À chaque nouveau niveau, une balle de plus est ajoutée dans le terrain, et le joueur dispose d'une vie de plus que dans le niveau précédent. Le temps imparti pour terminer le niveau est également augmenté.

source: Scoring is based on how much of the field is cleared.
fr: Le comptage des points se base sur la quantité de terrain libérée.

source: New walls are built by clicking the <mousebutton>left</mousebutton> mouse button in an active area of the field, at which point two walls will begin to grow in opposite directions from the square the mouse was clicked in. Only two walls may be growing on the screen at any given time.
fr: De nouveaux murs sont construits en cliquant avec le &BGS; sur la partie active du terrain, ce qui provoque la progression de deux murs à partir de la case où vous avez cliqué dans deux directions opposées. Deux murs seulement peuvent être en constructions à un moment donné.

source: A new wall growing
fr: Un nouveau mur en train de progresser

source: When the mouse is on the field, the cursor is shown as a pair of arrows pointing in opposite directions, either horizontally or vertically. The arrows point in the direction the walls will grow when the <mousebutton>left</mousebutton> is clicked. This direction can be changed by clicking the <mousebutton>right</mousebutton> mouse button.
fr: Quand le curseur de la souris est sur le terrain, il prend la forme d'une paire de flèches pointant dans des directions opposées, horizontales ou verticales. Les flèches pointent dans les directions dans lesquelles les murs se construiront si vous cliquez avec le &BGS;. Ces directions peuvent être changées en cliquant avec le &BDS;.

source: A new wall has a <quote>head</quote> which moves away from the point where the mouse was clicked. A wall is not permanent until this <quote>head</quote> runs into another wall. If a ball collides with any part of the wall except the head, before the head has run into another wall, the new wall will disappear completely and one life will be lost. If a ball collides with the head in the direction of the wall's growth, the wall will stop growing there, and become permanent, with no loss of life. If a ball collides with the head from any other side, the ball will bounce off and the wall will continue to grow normally.
fr: Un mur en cours de construction a une <quote>tête</quote> qui s'éloigne du point où vous avez cliqué. Un mur n'est pas permanent tant que sa <quote>tête</quote> n'a pas atteint le mur opposé. Si une balle entre en collision avec une partie du mur différente de sa tête, le mur en cours de construction disparaîtra complètement et une vie sera perdue. Si une balle entre en collision avec la tête dans la direction de la construction du mur, le mur s'arrêtera là et deviendra permanent, sans perte de vie. Si une balle entre en collision avec la tête du mur d'un autre côté, la balle rebondira et le mur continuera à avancer normalement.

source: Strategy
fr: Stratégie

source: Many players find the game becomes quite difficult by only the third or fourth level, given the number of balls on the field at once.
fr: La plupart des joueurs ne commencent à trouver le jeu difficile qu'à partir des troisième ou quatrième niveaux, à cause du nombre de balles simultanément en jeu.

source: The trick to playing &kjezz; successfully is to build <quote>corridors</quote>. To build a corridor, start a pair of walls growing close to another wall, and time it such that one of the walls will be hit by a ball and one of the walls will not, and thus become permanent.
fr: L'astuce pour gagner en jouant à &kjezz; est de construire des <quote>corridors</quote>. Pour construire, un corridor, démarrez un mur près d'un autre mur, et arrangez-vous pour qu'un des murs soit touché par une balle et que l'autre ne le soit pas, et qu'il devienne donc permanent.

source: Building a corridor
fr: Comment construire un corridor

source: This will leave a narrow corridor only a few squares high on the field, surrounded on three sides by walls. Wait for the balls to bounce into the open end of the corridor, and close the corridor behind the ball with a new wall. Although you will most likely lose a life for each corridor created, you can trap several balls in a single corridor.
fr: On construit ainsi dans le terrain un corridor étroit haut de seulement quelques cases, entouré sur trois côtés par des murs. Attendez que les balles rebondissent vers l'extrêmité ouverte du corridor, et fermez le corridor derrière la balle avec un nouveau mur. Bien qu'il soit probable que vous perdiez une vie pour chaque corridor créé, l'avantage est que vous pouvez capturer plusieurs balles avec un seul corridor.

source: Capturing balls in a corridor
fr: Capture de balles dans un corridor

source: A final tip &mdash; take your time! There is plenty of time, as shown in the <guilabel>Time</guilabel> display on the right hand side of the screen. Rushing will just get you in trouble!
fr: Un dernier conseil&nbsp;: prenez votre temps&nbsp;! Le temps imparti est long, comme vous le montre la zone <guilabel>Temps</guilabel> sur le côté droit de l'écran. Vous précipiter ne vous apporterait que des ennuis&nbsp;!

source: Menu Reference
fr: Description des menus

source: The <guimenu>Game</guimenu> Menu
fr: Le menu <guimenu>Jeu</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Nouveau</guimenuitem>

source: Start a new game.
fr: Démarre une nouvelle partie.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Fin</keycap> </keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Terminer la partie</guimenuitem>

source: End the current game.
fr: Arrête la partie en cours.

source: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
fr: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pause the game.
fr: Interrompt la partie.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show Highscores</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Meilleurs scores</guimenuitem>

source: Show the high score table.
fr: Affiche la liste des meilleurs scores.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Jeu</guimenu> <guimenuitem>Quitter</guimenuitem>

source: <action>Quit</action> and close &kjezz;.
fr: <action>Quitte</action> &kjezz;.

source: The <guimenu>Background</guimenu> Menu
fr: Le menu <guimenu>Fond</guimenu>

source: <guimenu>Background</guimenu> <guimenuitem>Select Images...</guimenuitem>
fr: <guimenu>Fond</guimenu> <guimenuitem>Sélectionner des images...</guimenuitem>

source: Choose an image for the background.
fr: Choisit une image de fond.

source: <guimenu>Background</guimenu> <guimenuitem>Show Images</guimenuitem>
fr: <guimenu>Fond</guimenu> <guimenuitem>Afficher des images...</guimenuitem>

source: Enable the background image.
fr: Valide l'image de fond.

source: The <guimenu>Help</guimenu> Menu
fr: Le menu <guimenu>aide</guimenu>

source: Credits and Licenses
fr: Remerciements et licences

source: Developers
fr: Developpeurs

source: Sandro Sigala <email>ssigala@globalnet.it</email> - Highscore
fr: Sandro Sigala <email>ssigala@globalnet.it</email> - Meilleurs scores

source: This handbook is dedicated to Dennis E. Powell.
fr: Ce manuel est dédicacé à Dennis E. Powell.

source: CREDIT_FOR_TRANSLATORS
fr: <para>Traduction française par Éric Bischoff <email>e.bischoff@noos.fr</email></para>
