Repository: Ekkro/PLC
Catalog: trabalhoP1/*/kjumpingcube.po
Languages: pt

source: on turn: Player %1
pt: rodada: Jogador %1

source: (Computer)
pt: (Computador)

source: Get &Hint
pt: Apanhar &Dica

source: &Playfield
pt: &Área de jogo

source: &Beginner
pt: &Iniciante

source: &Average
pt: &Na média

source: &Expert
pt: &Perito

source: S&kill
pt: &Habilidade

source: settings saved
pt: preferências salvas

source: The file %1 exists. Do you want to override it?
pt: O arquivo %1 existe. Deseja sobregravar?

source: game saved as %1
pt: jogo salva como %1

source: There was an error in saving file %1
pt: Ocorreu um erro ao salvar o arquivo %1

source: The file %1 doesn't exists!
pt: O arquivo %1 não existe!

source: The file %1 isn't a KJumpingCube gamefile!
pt: O arquivo %1 não é um arquivo do jogo KJumpingCuve!

source: There was an error loading file %1
pt: Ocorreu um erro ao carregar o arquivo %1

source: stopped activity
pt: atividade interrompida

source: color changed for player %1
pt: cor alterada para jogador %1

source: Winner is Player %1!
pt: Jogador %1 é vencedor!

source: Winner
pt: Vencedor

source: doing move
pt: movimentando

source: computing move
pt: analisando o movimento

source: Beginner
pt: Iniciante

source: Average
pt: Na média

source: Expert
pt: Perito

source: Skill of computerplayer is now: %1
pt: Habilidade do computador jogando é: %1

source: playfield changed to %1x%2
pt: campo do jogo alterado para %1x%2

source: Player %1 is now played by the computer.
pt: Jogador %1 agora joga com o computador.

source: Player %1 is now played by you.
pt: Jogador %1 agora joga com você.

source: Tactical one- or two-player game
pt: Tático, jogo de um ou dois jogadores

source: _: NAME OF TRANSLATORS Your names
pt: Elvis Pfützenreuter

source: _: EMAIL OF TRANSLATORS Your emails
pt: epx@conectiva.com.br
