Repository: Ekkro/PLC
Catalog: trabalhoP1/*/lskat.po
Languages: pt

source: _: NAME OF TRANSLATORS Your names
pt: Elvis Pfützenreuter

source: _: EMAIL OF TRANSLATORS Your emails
pt: Elvis Pfützenreuter

source: About Lieutnant sKat
pt: Sobre o Tenente Skat

source: Lieutnant Skat Version %1
pt: Lieutnant Skat Versão %1

source: (c) 2000 Martin Heni Email: martin@heni-online.de Game features: - Multiplayer network game - Up to two computer players Many thanks to Laura for betatesting!
pt: (c) 2000 Martin Heni Email: martin@heni-online.de Recursos: - Jogo em rede - Até dois computadores-jogadores Agradecimentos a Laura por testar!

source: Starting a new game...
pt: Iniciando um novo jogo...

source: &End Game
pt: &Finalizar jogo

source: Ending the current game...
pt: Finalizando o jogo corrente...

source: Aborts a currently played game. No winner will be declared.
pt: Aborta um jogo corrente. Nenhum jogador será declarado.

source: &Clear Statistics...
pt: &Limpar estatísticas...

source: Delete all time statistics...
pt: Apagar todas as estatísticas de tempo...

source: Clears the all time statistics which is kept in all sessions.
pt: Lima todas as estatísticas de tempo que são mantidas em todas as sessões.

source: Send &Message...
pt: Mandar &mensagem...

source: Sending message to remote player...
pt: Mandando mensagem para o jogador remoto...

source: Allows you to talk with a remote player.
pt: Permite a você falar com um jogador remoto

source: Exiting...
pt: Saindo...

source: Quits the program.
pt: Sai do programa.

source: Toggle the statusbar...
pt: Comutar a barra de status...

source: Startplayer
pt: Jogador inicial

source: Changing startplayer...
pt: Mudando jogador inicial...

source: Chooses which player begins the next game.
pt: Escolhe que jogador começa o próximo jogo.

source: Player &1
pt: Jogador &1

source: Player &2
pt: Jogador &2

source: Changing who plays player 1...
pt: Mudando quem é o jogador 1...

source: &Player
pt: &Jogador

source: &Computer
pt: &Computador

source: &Remote
pt: &Remoto

source: Changing who plays player 2...
pt: Mudando quem é o jogador 2...

source: &Level
pt: &Nível

source: Change level...
pt: Mudar nível...

source: Change the strength of the computer player.
pt: Muda a força do computador-jogador.

source: &Advanced
pt: &Avançado

source: &Hard
pt: &Difícil

source: Select &Carddeck...
pt: Selecionar &baralho...

source: Configure carddecks...
pt: Configurar baralhos...

source: Choose how the cards should look like.
pt: Escolha a aparência das cartas.

source: Change &Names...
pt: Mudar &nomes...

source: Configure player names...
pt: Configurar nomes dos jogadores...

source: This leaves space for the mover
pt: Isto deixa espaço para o movimento

source: Ready
pt: Pronto

source: Welcome to Lieutnant Skat
pt: Bem-vindo ao Tenente Skat

source: Lieutnant Skat
pt: Tenente Skat

source: Game ended...start a new one...
pt: Jogo terminado... inicie um novo...

source: No game running
pt: Nenhum jogo em curso

source: %1 to move ...
pt: %1 para mover ...

source: Remote connection to %1:%2...
pt: Conexão remota para %1:%2...

source: Offering remote connection on port %1 ...
pt: Oferecendo conexão remota na porta %1 ...

source: Abort
pt: Abortar

source: About the program...
pt: Sobre o programa...

source: Waiting for the computer to move...
pt: Aguardando pelo computador jogar...

source: Waiting for remote player...
pt: Aguardando jogador remoto...

source: Please make your move...
pt: Faça seu movimento...

source: Remote connection lost for player 1...
pt: Conexão remota perdida para jogador 1...

source: Remote connection lost for player 2...
pt: Conexão remota perdida para jogador 2...

source: Message from remote player:
pt: Mensagem do jogador remoto:

source: Remote player ended game...
pt: Jogador remoto terminou o jogo...

source: You are network client...loading remote game...
pt: Você é cliente de rede... carregando jogo remoto...

source: You are network server...
pt: Você é servidor de rede...

source: Severe internal error. Move to illegal position. Restart game and report bug to the developer.
pt: Erro interno severo. Movimento para posição ilegal. Reinicie o jogo e reporte o problema ao desenvolvedor.

source: Ehm, this move would not follow the rulebook. Better think again!
pt: Hmm, este jogo não segue a regra. Melhor pensar novamente!

source: It is not your turn.
pt: Não é sua vez.

source: This move is not possible.
pt: Este movimento não é possível.

source: Alice
pt: Maria

source: Bob
pt: João

source: for
pt: para

source: Game over
pt: Fim de jogo

source: Game was aborted - no winner
pt: O jogo foi abortado - sem vencedor

source: Game is drawn
pt: Jogo empatado

source: Player 1 - %1 won
pt: Jogador 1 - %1 venceu

source: Player 2 - %1 won
pt: Jogador 2 - %1 venceu

source: Score:
pt: Pontos:

source: %1 won over 90 points. Super!
pt: %1 venceu por mais de 90 pontos. Super!

source: Move:
pt: Movimento:

source: Points:
pt: Pontos:

source: Won:
pt: Venceu:

source: Games:
pt: Jogos:

source: Hold on..the other was not yet gone...
pt: Espere... o outro ainda não se foi...

source: Hold your horses...
pt: Segure seus cavalos...

source: Ah ah ah...only one go at a time...
pt: Ah ah ah... somente um por vez...

source: Please wait... it is not your turn.
pt: Aguarde... não é sua vez.

source: Enter debug level
pt: Digite o nível de depuração

source: Enter message
pt: Digite mensagem

source: Send
pt: Mandar

source: Player names
pt: Nomes dos jogadores

source: Player 1
pt: Jogador 1

source: Enter a player's name
pt: Digite um nome de jogador

source: Player 2
pt: Jogador 2

source: Remote settings
pt: Preferências remotas...

source: localhost
pt: máquina local

source: Remote host
pt: Máquina remota

source: Port
pt: Porta

source: You can leave the remote host input empty. Then your computer acts as server only and does not try to connect to a remote host.
pt: Você pode deixar a entrada da máquina remota vazia. Então seu computador será o servidor e não tentará conectar-se a um computador remoto.
