Repository: Ekkro/PLC
Catalog: trabalhoP/*/kenolaba.po
Languages: fr

source: The &kenolaba; Handbook
fr: Le manuel de &kenolaba;

source: Reviewer
fr: Relecteur

source: ROLES_OF_TRANSLATORS
fr: <othercredit role="translator"><firstname>Gérard</firstname><surname>Delafond</surname><affiliation><address><email>g.delafond@medsyn.fr</email></address></affiliation><contrib>Traducteur</contrib></othercredit>

source: &kenolaba; is a simple board strategy game that is played by two players.
fr: &kenolaba; est un jeu de stratégie simple spour deux joueurs qui se joue sur un plateau.

source: game
fr: jeu

source: &kenolaba; is a simple board strategy game that is played by two players. There are red and yellow pieces for each player. Beginning from a start position where each player has 14 pieces, moves are drawn until one player has pushed 6 of his opponent's pieces out of the board.
fr: &kenolaba; est un simple jeu de stratégie qui se joue à deux sur un plateau. Chaque joueur a une couleur&nbsp;: soit rouge, soit jaune. Chaque joueur commence avec 14 boules. Le but du jeu est de déplacer ses boules de manière à pousser six boules de l'adversaire hors du plateau.

source: The original program was developed in 1993 for DOS and pure Xlib. For &kde; there was a major rewrite.
fr: Le programme original a été développé pour DOS et XLib pure en 1993. Le portage sous &kde; a nécessité des modifications majeures.

source: If you know the board game called Abalone, you will like this program. In fact, this program was inspired by the mentioned game. Abalone is a trademark of Abalone SA, France.
fr: Si vous connaissez le jeu sur plateau appelé Abalone, vous aimerez ce programme. En fait, ce programme s'inspire de ce jeu. Abalone est une marque déposée de Abalone S.A., France.

source: Rules of the Game
fr: Règles du jeu

source: Red always moves first.
fr: Les rouges jouent toujours en premier.

source: Two types of moves are allowed:
fr: Deux types de déplacements sont autorisés&nbsp;:

source: One, two or three pieces of yours in a row can be moved be one in the 6 directions. Side moves are also allowed.
fr: Vous pouvez déplacer une, deux ou trois pièces alignées dans l'une des six directions. Les déplacements latéraux sont également autorisés.

source: Press the left mouse button on the first piece you want to move. The piece will then be highlighted. Now drag the mouse in the desired direction. If the move is valid, the cursor will change to an arrow in that direction and all the pieces of the move will be highlighted. If this is the move you want to draw, release the mouse button.
fr: Cliquez avec le bouton gauche de la souris sur la première pièce que vous voulez bouger. La pièce est alors mise en sur-brillance. Maintenant, glissez la souris jusqu'à la position désirée. Si le mouvement est possible, le pointeur de la souris se transforme en flèche dans cette direction et toutes les boules à déplacer sont mises en sur-brillance. Pour confirmer le déplacement, relâchez le bouton de la souris..

source: Side moves are handled another way: For two adjacent pieces click between them and drag; for three pieces press the <mousebutton>middle</mousebutton> mouse button on the middle piece - if a side move is allowed for the pieces they will be highlighted. Otherwise only the middle one is highlighted and you draw a normal move.
fr: Les mouvements de front de plusieurs boules sont gérés de manière différente. Pour deux boules adjacentes, cliquez entre les deux boules et faites glisser&nbsp;; pour trois boules, cliquez sur celle du milieu avec le bouton <mousebutton>central</mousebutton> de la souris. Si un mouvement de front est autorisé pour ces boules, elles seront mises en sur brillance. Sinon, seule celle du milieu le sera, et il s'agira d'un mouvement normal.

source: Pushing
fr: Pousser

source: You can push a maximum of two pieces of the opponent in front of your own pieces as long as the number of pieces you move is greater than the number of the opponent's pieces that you push. That means with three of your pieces you can push one or two of the opponent's and with two pieces one.
fr: Vous ne pouvez pousser au plus que deux boules adverses et ceci seulement si le nombre de boules que vous déplacez est supérieur à celui de votre adversaire. Ce qui veut dire qu'avec trois boules, vous ne pouvez en pousser qu'une ou deux et avec deux, une seule.

source: Special pushing moves are those which push a piece of the opponent out of the board. If you have pushed six of your opponent's pieces out of the board you have won.
fr: Un cas spécial est celui où vous poussez une boule de votre adversaire hors du plateau. Si vous le faites six fois, vous avez gagné.

source: If you still do not know what &kenolaba; is all about, look at a game where the computer plays both sides. After executing &kenolaba;, select <menuchoice><guimenu>Settings</guimenu><guisubmenu>Computer plays</guisubmenu><guimenuitem>Both</guimenuitem></menuchoice> and start a new game.
fr: Si vous avez de la difficulté à comprendre le jeu, laissez l'ordinateur jouer tout seul. Pour cela, après avoir lancé &kenolaba;, choisissez <menuchoice> <guimenu>Configuration</guimenu> <guisubmenu>L'ordinateur joue avec</guisubmenu> <guimenuitem>Les deux</guimenuitem> </menuchoice> et commencez une nouvelle partie.

source: Network Play
fr: Jeu en réseau

source: General Network Play
fr: Généralités sur le jeu en réseau

source: &kenolaba; supports playing across a network. This allows two people to play against each other on different computers, or one person to observe the game play of another &kenolaba; program. To use &kenolaba;'s network features, &kenolaba; must be set to Network Mode by selecting <menuchoice><guimenu>Game</guimenu><guimenuitem>Network</guimenuitem></menuchoice>.
fr: &kenolaba; gère le jeu en réseau. Cela permet à deux personnes de jouer l'une contre l'autre sur deux ordinateurs différents, ou à une personne d'observer le jeu d'un autre programme &kenolaba;. Pour utiliser les possibilités de jeu en réseau de &kenolaba;, vous devez le passer en mode réseau en sélectionnant <menuchoice><guimenu>Jeu</guimenu><guimenuitem>Partie en réseau</guimenuitem></menuchoice>.

source: All running &kenolaba; programs which are in Network Mode broadcast changed positions to each other.
fr: Tous les programmes &kenolaba; qui sont en mode réseau échangent des informations sur les déplacements des boules.

source: To exchange positions, the &kenolaba; programs have to be told about each other. If they are running on the same machine, nothing is needed (apart from switching to Network Mode). If running on different computers you have to specify the other's machine on the command line with the <option>-h</option> switch, as so:
fr: Pour fournir des informations sur les positions, les programmes &kenolaba; doivent se connaître. S'ils fonctionnent sur la même machine, il n'y a besoin de rien (sauf de choisir le mode réseau). S'ils fonctionnent sur des ordinateurs différents, vous devez préciser la machine de votre adversaire sur une ligne de commande avec l'option <option>-h</option> de cette manière&nbsp;:

source: <prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>SomeHostName</replaceable></parameter></userinput>
fr: <prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option><parameter><replaceable>un_nom_d_hote</replaceable></parameter></userinput>

source: For insiders: &kenolaba;, when in Network Mode, listens on a <acronym>TCP</acronym> socket for position change commands by other &kenolaba; programs. You can specify the port number with the <option>-p</option> command line switch. You need this if you want to play two different &kenolaba; Network games.
fr: Pour ceux qui veulent des détails, &kenolaba; en mode réseau écoute une socket <acronym>TCP</acronym> pour connaître les changements de positions. On peut spécifier un port de communication avec l'option de ligne de commande <option>-p</option>. C'est nécessaire si vous voulez jouer deux jeux &kenolaba; différents en réseau.

source: Examples
fr: Exemples

source: Chris on <systemitem class="systemname">machine1</systemitem> and Mary on <systemitem class="systemname">machine2</systemitem> want to play against each other: Mary simply starts &kenolaba;, sets <menuchoice><guimenu>Options</guimenu><guisubmenu>Computer plays</guisubmenu></menuchoice> to <guimenuitem>None</guimenuitem> and switches to Network Mode. Chris starts &kenolaba; with <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>machine2</replaceable></parameter></userinput></screen> and then does the same as Mary. Now one of the two can start the game and draw a red move. Each time the position is changed in one program, it automatically changes in the other one too.
fr: Chris sur <systemitem class="systemname">machine1</systemitem> et Mary sur <systemitem class="systemname">machine2</systemitem> veulent jouer l'un contre l'autre&nbsp;: Mary démarre simplement &kenolaba;, règle le menu <menuchoice><guimenu>Configuration</guimenu> <guisubmenu>L'ordinateur joue avec</guisubmenu></menuchoice> sur <guimenuitem>Aucun</guimenuitem> et passe en mode réseau. Chris démarre &kenolaba; avec <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>machine2</replaceable></parameter></userinput></screen> et fait comme Mary. Maintenant, l'un des deux peut commencer en bougeant les rouges. Chaque fois que les positions des boules changent dans l'un des deux programmes, ces changements sont automatiquement reportés dans l'autre programme.

source: John wants to observe the game: He does the same as Chris, but doesn't draw a move himself.
fr: John veut regarder un jeu. Il fait pareil que Chris, mais ne bouge pas les boules lui-même.

source: Two different &kenolaba; Network Games will run among machines <systemitem class="systemname">m1</systemitem> and <systemitem class="systemname">m2</systemitem>. To distinguish the games, we choose port number 12345 for one. On <systemitem class="systemname">m1</systemitem> we start as usual: <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command></userinput></screen> for the first game, and (not so usual): <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command> <option>-p</option> <parameter><replaceable>12345</replaceable></parameter></userinput></screen> for the second. On <systemitem class="systemname">m2</systemitem> we start the first game with: <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>m1</replaceable></parameter></userinput></screen> and the second with: <screen width="40"><prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>m1:12345</replaceable></parameter></userinput></screen> (The colon separates host and port as in a &URL;).
fr: Il existe deux modes réseau différents pour &kenolaba; sur les machines <systemitem class="systemname">m1</systemitem> et <systemitem class="systemname">m2</systemitem>. Pour distinguer les parties, choisissons le port 12345 pour l'une. Sur <systemitem class="systemname">m1</systemitem>, on démarre comme d'habitude avec&nbsp;: <screen width="40"> <prompt>%</prompt><userinput><command>kenolaba</command></userinput> </screen> pour le premier et (inhabituel) <screen width="40"> <prompt>%</prompt><userinput><command>kenolaba</command> <option>-p</option> <parameter><replaceable>12345</replaceable></parameter></userinput> </screen> pour le deuxième. Sur <systemitem class="systemname">m2</systemitem> nous démarrons <screen width="40"> <prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>m1</replaceable></parameter></userinput> </screen> et le deuxième avec&nbsp;: <screen width="40"> <prompt>%</prompt><userinput><command>kenolaba</command> <option>-h</option> <parameter><replaceable>m1:12345</replaceable></parameter></userinput> </screen> (Les deux points séparent l'hôte et le port comme dans une &URL;).

source: Advanced Options
fr: Options avancées

source: Modify Mode
fr: Mode modification

source: You can edit the actual board position by selecting <menuchoice><guimenu>Edit</guimenu><guimenuitem>Modify</guimenuitem></menuchoice> to put &kenolaba; in Modify Mode.You can add red or yellow pieces or delete them. The status line shows the number of red and yellow pieces, the move number, the side which is to draw the next move, and whether the position is valid: An exclamation sign means no, a checked symbol yes.
fr: Vous pouvez modifier le plateau actuel en choisissant <menuchoice><guimenu>Édition</guimenu><guimenuitem>Modifier</guimenuitem></menuchoice> pour passer &kenolaba; en mode modification. Vous pouvez ajouter des pièces rouges ou jaunes ou en supprimer. La barre d'état vous indique le nombre de pièces rouges et jaunes, le numéro du coup, le prochain joueur, et si la position est valide. Un point d'exclamation signifie NON, et un signe <quote>coché</quote> veut dire OUI.

source: If the position is invalid and you switch back to normal Play Mode, you can't play! Only valid positions can be used as a starting position for a game.
fr: Si la position est non valide et que vous retournez en mode Jeu, vous ne pouvez pas jouer&nbsp;! Seules des positions valides peuvent être utilisées comme positions de départ pour une partie.

source: <action>Take back</action> and <action>Forward</action> simply decrement and increment the move number, but don't change any pieces.
fr: <action>Précédent</action> et <action>Suivant</action> changent seulement le numéro du mouvement mais ne changent aucune pièce.

source: Usage
fr: Utilisation

source: By pressing the <mousebutton>left</mousebutton> or <mousebutton>right</mousebutton> mouse button on an empty or yellow field, you enter <quote>Red piece Adding</quote> mode; by pressing the <mousebutton>middle</mousebutton> button on an empty or red field, you get in <quote>Yellow piece Adding</quote> mode. Finally by pressing the <mousebutton>left</mousebutton> or the <mousebutton>right</mousebutton> mouse button on a red piece, or the <mousebutton>middle</mousebutton> mouse button on an yellow piece, you enter <quote>Piece Deleting</quote> Mode. Any piece that the mouse passes over with the button pressed will be deleted.
fr: En cliquant avec le bouton <mousebutton>gauche</mousebutton> ou <mousebutton>droit</mousebutton> de la souris sur une case vide ou jaune, vous passez en mode <quote>Ajout de boule rouge</quote>&nbsp;; en cliquant avec le bouton <mousebutton>central</mousebutton> sur une case vide ou rouge, vous passez en mode <quote>Ajout de boule jaune</quote>. Enfin, en cliquant avec le bouton <mousebutton>gauche</mousebutton> ou <mousebutton>droit</mousebutton> sur une boule rouge ou avec le bouton <mousebutton>central</mousebutton> sur une pièce jaune, vous passez en mode <quote>Suppression de boule</quote>. En tenant le bouton enfoncé et en balayant aux alentours, vous agirez sur chaque case que vous survolez. Vous finissez la modification en relâchant le bouton.

source: To exit Modify Mode and re-enter Play Mode, just uncheck <guimenuitem>Modify</guimenuitem> in the <guimenu>Edit</guimenu> menu.
fr: Pour quitter le mode de modification et revenir en mode jeu, décochez simplement <guimenuitem>Modifier</guimenuitem> du menu <guimenu>Édition</guimenu>.

source: Using the Clipboard
fr: Utilisation du Presse-papiers

source: The current &kenolaba; board can be copied to the clipboard using the <guimenuitem>Copy</guimenuitem> command in the <guimenu>Edit</guimenu> menu, and then pasted back in using <guimenuitem>Paste</guimenuitem>. This way you can copy the board positions of one &kenolaba; program to another by pressing <guimenuitem>Copy</guimenuitem> in one program and <guimenuitem>Paste</guimenuitem> in the other, but this is better done with Network Mode (see above). Another usage is to save positions into a text file (using <guimenuitem>Copy</guimenuitem> and your Editor of choice) and retrieve a position later by selecting it in the editor and pasting in &kenolaba;.
fr: Le plateau en cours de &kenolaba; peut être copié dans le presse-papiers en utilisant la commande <guimenuitem>Copier</guimenuitem> du menu <guimenu>Édition</guimenu>, et collée en utilisant <guimenuitem>Coller</guimenuitem>. Vous pouvez ainsi copier l'état du plateau d'un programme &kenolaba; vers un autre en sélectionnant <guimenuitem>Copier</guimenuitem> dans un programme et <guimenuitem>Coller</guimenuitem> dans l'autre, mais pour ce faire il vaut mieux utiliser le mode réseau (voir ci-dessus). Une autre utilisation est d'enregistrer les positions dans un fichier texte (en utilisant <guimenuitem>Copier</guimenuitem> et votre éditeur favori) et de récupérer ces positions plus tard en les sélectionnant dans l'éditeur et en les collant dans &kenolaba;.

source: Computer Level
fr: Niveau

source: The computer can play at four different levels, namely:
fr: L'ordinateur peut jouer à quatre niveaux différents, nommés&nbsp;:

source: Easy
fr: Facile

source: Hard
fr: Difficile

source: Challenge
fr: Défi

source: The harder the setting, the longer the computer searches for a move. You can interrupt the search by pressing the <keycap>S</keycap> key.
fr: Plus le réglage est difficile, plus l'ordinateur cherche longtemps le meilleur mouvement. Vous pouvez interrompre sa recherche en enfonçant la touche <keycap>S</keycap>.

source: Spying
fr: Espion

source: <quote>Spying</quote> can be turned on and off from the <guimenu>Settings</guimenu> menu, and the <guimenuitem>Spy</guimenuitem> option. If it is your turn, you can see the computer's rating of the move you want to play in the status bar. If it's the computer's turn you can see (in status bar and highlighted pieces) the move he actually thinks is the best to play. Of course this changes along his search.
fr: <quote>Espion</quote> peut être activé ou désactivé à partir du menu <guimenu>Configuration</guimenu>, option <guimenuitem>Espion</guimenuitem>. Si c'est votre tour, vous pouvez voir dans la barre d'état l'estimation de l'ordinateur quant au déplacement que vous voulez faire. Si c'est au tour de l'ordinateur, vous pouvez voir (dans la barre d'état et avec les pièces en sur-brillance) le mouvement qu'il pense actuellement être le meilleur. Bien sûr, ceci change durant sa recherche.

source: Selecting what color the computer plays
fr: Choix de la couleur jouée par l'ordinateur

source: You can make the computer play Red, Yellow or both sides. Choose between these options before starting a new game. Of course it works in a game too if you want to change sides. Choose <guimenuitem>None</guimenuitem> to play against another human. This is very useful in Network Mode.
fr: Vous pouvez choisir que l'ordinateur joue avec les Rouges, les Jaunes, ou les deux. Choisissez avant de commencer une partie. Bien sûr, pendant le jeu, vous pouvez changer de coté également. Choisissez <guimenuitem>Aucun</guimenuitem> pour jouer contre quelqu'un d'autre. C'est très utile en mode réseau.

source: Advanced Configuration
fr: Configuration avancée

source: &kenolaba; offers advanced configuration options for the daring, enabling you to change the whole scoring system if you wish. To access these advanced options, select <guimenu>Settings</guimenu><guimenuitem>Configure Kenolaba</guimenuitem>. As you change settings, the score that your modified settings give for the current move is displayed at the bottom of the dialog, next to <guilabel>Evaluation of actual position</guilabel>.
fr: &kenolaba; offre des options de configuration avancées pour les intrépides, en vous permettant de changer l'ensemble du système de comptage des points si vous le souhaitez. Pour accéder à ces options avancées, choisissez <guimenu>Configuration</guimenu> <guimenuitem>Configurer KEnolaba</guimenuitem>. Lorsque vous changez les réglages, le score obtenu pour la position actuelle avec ces réglages est affiché en bas de la boîte de dialogue, en face de <guilabel>Score pour la position actuelle</guilabel>.

source: The <guilabel>Moves</guilabel> Tab
fr: L'onglet <guilabel>Mouvements</guilabel>

source: The number of points added to the total for each type of move can be modified here, depending on the type of move, and how many pieces are involved. The moves are divided into three types:
fr: Le nombre de points ajoutés à chaque coup peut être modifié ici, en fonction du type de coup et du nombre de boules impliquées. Les coups joués peuvent se classer dans trois catégories différentes&nbsp;:

source: A normal move is one in which you move one or more pieces of your own, but do not push any of your opponent's pieces.
fr: Un coup normal est un coup lors duquel vous déplacez une ou plusieurs de vos boules, mais lors duquel vous ne poussez aucune des boules de votre adversaire.

source: Push
fr: Pousser

source: A push move is one in which you push one or more of your opponent's pieces, but they remain on the board.
fr: Lors d'un coup de type <quote>pousser</quote>, vous poussez une ou plusieurs boules appartenant à votre adversaire, mais elles restent sur le plateau.

source: Push Out
fr: Pousser à l'extérieur

source: A push out move is one in which you push one or more of your opponent's pieces off the board.
fr: Lors d'un coup de type <quote>pousser à l'extérieur</quote>, vous poussez une ou plusieurs des boules appartenant à votre adversaire hors du plateau.

source: The <guilabel>Position</guilabel> Tab
fr: L'onglet <guilabel>Position</guilabel>

source: The number of points added to the total score for a board position is dependent on which ring on the board the pieces are on. For each ring, from the centre out, an average score to add can be set, with a +/- range. The score given for a particular position is varied randomly within the +/- range. This is to stop computer-computer games going into an infinite loop.
fr: Le nombre de points ajoutés au score total pour une position de plateau dépend du cercle du plateau sur lequel les boules sont. Pour chaque cercle, du centre vers l'extérieur, un nombre de points moyen peut être défini, avec une intervalle en plus ou en moins. Le score attribué à une position donnée varie aléatoirement à l'intérieur de cet intervalle. Ce mécanisme permet d'empêcher les parties jouées uniquement par l'ordinateur de partir dans une boucle infinie.

source: The <guilabel>In-A-Row</guilabel> Tab
fr: L'onglet <guilabel>Alignement</guilabel>

source: For each time the number of pieces in a row occurs, the given number of points is added to the score, &eg; <inlinemediaobject> <imageobject> <imagedata fileref="kenolaba-pieces.png" format="PNG"/> </imageobject> <textobject> <phrase>X O O O</phrase> </textobject> </inlinemediaobject> adds the score for three in a row, and also two times the score for two in a row.
fr: À chaque fois qu'un certain nombre de boules sont alignées, le nombre de points défini ici points est ajouté au score score, &pex; <inlinemediaobject> <imageobject> <imagedata fileref="kenolaba-pieces.png" format="PNG"/> </imageobject> <textobject> <phrase>X O O O</phrase> </textobject> </inlinemediaobject> ajoute les points correspondants à un alignement de trois pièces, ainsi que deux fois les points correspondants à un alignement de deux pièces.

source: The <guilabel>Count</guilabel> Tab
fr: L'onglet <guilabel>Nombre de boules</guilabel>
