Repository: Ekkro/PLC
Catalog: trabalhoP/*/kenolaba.po
Languages: fr

source: Adds the given amount of points based on the difference in the number of balls on both sides, from <guilabel>1 ball more</guilabel> up to <guilabel>5 balls more</guilabel>. If there is a difference of 6 balls, the game is over.
fr: Ajoute le nombre de points définis ici en fonction de la différence dans le nombre de boules de chaque adversaire, de <guilabel>1 boule de plus</guilabel> à <guilabel>5 boules de plus</guilabel>. S'il y a une différence de six boules, la partie est finie.

source: Menu Reference
fr: Référence des menus

source: Drawing moves is explained under <link linkend="rules-of-the-game">Rules of the Game</link>. The buttons in the toolbar have the same meaning as entries in the <guimenu>Game</guimenu> or <guimenu>Edit</guimenu> menu.
fr: La manière de déplacer les boules est expliquée à la section <link linkend="rules-of-the-game">Règles du jeu</link>. Les boutons de la barre d'outils ont la même signification que les items du menu <guimenu>Jeu</guimenu> ou <guimenu>Édition</guimenu>.

source: The <guimenu>Game</guimenu> Menu
fr: Le menu <guimenu>Jeu</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Jeu</guimenu><guimenuitem>Nouveau</guimenuitem>

source: <action>Starts a new game</action> even if a game is currently in play.
fr: <action>Commence une nouvelle partie</action>, même si une partie est déjà en cours.

source: <shortcut> <keycombo><keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Stop Search</guimenuitem>
fr: <shortcut><keycombo><keycap>S</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Arrêter la réflexion</guimenuitem>

source: When the computer is thinking, his depth search is interrupted and he draws the best move he has found so far.
fr: Quand l'ordinateur réfléchit, sa recherche est interrompue et il joue le meilleur coup qu'il a trouvé à cet instant.

source: <shortcut> <keycombo><keycap>PgUp</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Take Back</guimenuitem>
fr: <shortcut><keycombo><keycap>Page Haut</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Précédent</guimenuitem>

source: Take back your previous move. Two (!) moves are undone: the opponents move and your last move. So it's your turn again. 100 moves are remembered; so don't hesitate to take back moves until you are at the beginning of the game (faster with the <keycap>F2</keycap> key). When in Modify mode (see <menuchoice><guimenu>Edit</guimenu><guimenuitem>Modify</guimenuitem></menuchoice> below), decrement move number of this position.
fr: Revient à votre précédent déplacement. Deux (!) coups sont annulés&nbsp;: le mouvement de l'adversaire et votre dernier mouvement. C'est donc à nouveau à vous de jouer. Cent mouvements sont mémorisés&nbsp;; n'hésitez donc pas à revenir en arrière jusqu'au début du jeu (plus rapide avec la touche <keycap>F2</keycap>). Le mode Modifier (voir le menu <menuchoice><guimenu>Édition</guimenu> <guimenuitem>Modifier</guimenuitem></menuchoice> ci-dessous), décrémente le numéro de cette position.

source: <shortcut> <keycombo><keycap>PgDown</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Forward</guimenuitem>
fr: <shortcut><keycombo><keycap>Page-bas</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Suivant</guimenuitem>

source: Only useful in Modify mode: Increment move number of this position.
fr: Utile seulement en mode Modifier&nbsp;: augmente le numéro de la position.

source: <shortcut> <keycombo><keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Hint</guimenuitem>
fr: <shortcut><keycombo><keycap>H</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Conseil</guimenuitem>

source: A hint for your next move is shown. Only possible if you play at level normal or above, the move number is 2 or greater and you have not undone your move.
fr: Une aide pour le mouvement suivant est donnée. Possible seulement dans le cas où vous jouez en mode normal ou supérieur, le numéro de la position est supérieur à 2, et votre mouvement n'a pas été annulé.

source: <shortcut> <keycombo><keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Network Play</guimenuitem>
fr: <shortcut><keycombo><keycap>N</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Partie en réseau</guimenuitem>

source: If this toggle is switched on, the application is in Network Mode.
fr: Si ceci est activé, l'application est en mode réseau.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Jeu</guimenu><guimenuitem>Quitter</guimenuitem>

source: <action>Quits</action>&kenolaba;.
fr: <action>Quitte</action> &kenolaba;.

source: The <guimenu>Edit</guimenu> Menu
fr: Le menu <guimenu>Édition</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Copier</guimenuitem>

source: Copy a representation of the &kenolaba; board to the clipboard
fr: Copie une représentation du plateau de &kenolaba; dans le presse-papiers.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Coller</guimenuitem>

source: Interpret the content of the X clipboard as an ASCII representation of a &kenolaba; board, and copy it to the current board. A valid ASCII representation is generated by <guimenuitem>Copy</guimenuitem>.
fr: Interprète le contenu du presse-papiers comme le codage ASCII du plateau de jeu de &kenolaba;. Une représentation du plateau valide peut être obtenue en faisant <guimenuitem>Copier</guimenuitem>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ins</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Modify</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>Inser</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Modifier</guimenuitem>

source: Switches &kenolaba; to Modify Mode.
fr: Bascule &kenolaba; en mode modification.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Save Position</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Mémorieser la position</guimenuitem>

source: Save the actual position to be retrieved later with <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Restore Position</guimenuitem> </menuchoice>.
fr: Vous pouvez enregistrer la position actuelle et la retrouver plus tard avec <menuchoice><guimenu>Édition</guimenu><guimenuitem>Restaurer la position</guimenuitem></menuchoice>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Restore Position</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Édition</guimenu><guimenuitem>Restaurer la position</guimenuitem>

source: Restore the board position stored in the &kenolaba; Configuration file by <guimenu>Edit</guimenu> <guimenuitem>Save Position</guimenuitem>.
fr: Restaure la position enregistrée dans le fichier de configuration de &kenolaba; par <guimenu>Édition</guimenu> <guimenuitem>Mémoriser la position</guimenuitem>.

source: The <guimenu>Settings</guimenu> Menu
fr: Le menu <guimenu>Configuration</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>M</keycap> </keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
fr: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Configuration</guimenu><guimenuitem>Afficher la barre de menus</guimenuitem>

source: Shows or hides the &kenolaba; Menubar.
fr: Montre ou cache la barre de menus de &kenolaba;.

source: <guimenu>Settings</guimenu><guimenuitem>Show Toolbar</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Afficher la barre d'outils</guimenuitem>

source: Shows or hides the &kenolaba; Toolbar.
fr: Montre ou cache la barre d'outils de &kenolaba;.

source: <guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Afficher la barre d'état</guimenuitem>

source: Shows or hides the &kenolaba; Statusbar at the base of the screen.
fr: Montre ou cache la barre d'état de &kenolaba; en bas de l'écran.

source: <guimenu>Settings</guimenu><guimenuitem>Save Settings</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Enregistrer la configuration</guimenuitem>

source: Saves the current settings to become the default for &kenolaba;.
fr: Enregistre les valeurs actuelles des options comme valeurs par défaut de &kenolaba;.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Key Bindings...</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Raccourcis clavier...</guimenuitem>

source: Brings up the standard &kde; key bindings configuration window to customize the key bindings used by &kenolaba;.
fr: Ouvre une boîte de dialogue standard de &kde; qui vous permet de personnaliser les raccourcis-clavier de &kenolaba;.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Barre d'outils...</guimenuitem>

source: Brings up the standard &kde; toolbar configuration window to customize the &kenolaba; toolbar.
fr: Ouvre une boîte de dialogue standard de &kde; vous permettant de personnaliser la barre d'outils de &kenolaba;.

source: <guimenu>Settings</guimenu><guisubmenu>Level</guisubmenu>
fr: <guimenu>Configuration</guimenu><guimenuitem>Niveau</guimenuitem>

source: Select the level that the computer plays at. Can be one of:
fr: Choisissez le niveau auquel joue l'ordinateur. Ce peut être&nbsp;:

source: <guimenu>Settings</guimenu><guisubmenu>Computer Plays</guisubmenu>
fr: <guimenu>Configuration</guimenu><guisubmenu>L'ordinateur joue avec</guisubmenu>

source: Choose which colors the computer plays. Can be one of:
fr: Vous pouvez choisir que l'ordinateur joue avec&nbsp;:

source: <guimenuitem>Red</guimenuitem>
fr: <guimenuitem>Les rouges</guimenuitem>

source: Yellow
fr: Les jaunes

source: Both
fr: Les deux

source: None
fr: Aucun

source: <guimenu>Settings</guimenu><guimenuitem>Move Slow</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Déplacements lents</guimenuitem>

source: A move drawn by the computer when this option is checked is shown by blinking and highlighting the pieces used in this move. Uncheck this option if you don't want to wait for this animation: Then only a quick highlighting is done.
fr: Un mouvement de l'ordinateur est généralement montré (si cette option est cochée) en faisant clignoter et en rehaussant la couleur des pièces utilisées. Dé-sélectionnez cette option si vous ne voulez pas attendre cette animation. Seule la sur-brillance se fera.

source: <guimenu>Settings</guimenu><guimenuitem>Render Balls</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Boules élégantes</guimenuitem>

source: If checked, the pieces are rendered online by an internal simple ray tracer when needed (&eg; when resizing the window).
fr: Si vous sélectionnez cette option, le rendu des boules est fait par un traceur de rayon lumineux quand c'est nécessaire, &pex; quand on redimensionne la fenêtre.

source: <guimenu>Settings</guimenu><guimenuitem>Spy</guimenuitem>
fr: <guimenu>Configuration</guimenu><guimenuitem>Espion</guimenuitem>

source: If checked: Turns on <quote>spying</quote>.
fr: Si vous cochez cette option, vous activez le mode <quote>Espion</quote>.

source: The <guimenuitem>Help</guimenuitem> Menu
fr: Le menu <guimenuitem>Aide</guimenuitem>

source: Command line options
fr: Options de ligne de commande

source: With <option>-p</option> you specify the port number of the listening TCP socket when in Network Mode.
fr: Avec <option>-p</option>, vous spécifiez le numéro de port que doit écouter le socket TCP quand vous êtes en mode réseau

source: With <option>-h</option> you specify a remote &kenolaba; process (with optional port number, when not using the default port on the remote machine) to communicate with when in Network mode. You can specify multiple remote processes.
fr: Avec <option>-h</option>, vous précisez un processus &kenolaba; distant (avec éventuellement un numéro de port, si vous n'utilisez pas celui par défaut sur la machine distante) pour communiquer en mode réseau. Vous pouvez spécifier plusieurs processus distants.

source: Credits &amp; Licenses
fr: Remerciements et Licences

source: Program copyright 1997-2000 Josef Weidendorfer <email>Josef.Weidendorfer@gmx.de</email>
fr: Programme copyright 1997-2000 Josef Weidendorfer <email>weidendo@informatik.tu-muenchen.de</email>

source: Original Documentation by Robert Williams <email>rwilliams@kde.org</email> and Josef Weidendorfer
fr: Documentation originale par Robert Williams <email>rwilliams@kde.org</email> et Josef Weidendorfer

source: Documentation updated for &kde; 2.0 by Philip Rodrigues <email>phil.rod@ntlworld.com</email>
fr: Documentation mise à jour pour &kde; 2.0 par Philip Rodrigues <email>phil.rod@ntlworld.com</email>

source: CREDIT_FOR_TRANSLATORS
fr: <para>Traduction française par Gérard Delafond <email>g.delafond@medsyn.fr</email></para>

source: How to obtain &kenolaba;
fr: Comment obtenir &kenolaba;

source: Compilation and Installation
fr: Compilation et installation
