Repository: Ekkro/PLC
Catalog: trabalhoP/*/ksirtet.po
Languages: fr

source: The &ksirtet; Handbook
fr: Le Manuel de &ksirtet;

source: ROLES_OF_TRANSLATORS
fr: <othercredit role="translator"><firstname>Romain</firstname><surname>Quidet</surname><affiliation><address><email>rquidet@yahoo.com</email></address></affiliation><contrib>Traduction française</contrib></othercredit><othercredit role="translator"><firstname>Ludovic</firstname><surname>Grossard</surname><affiliation><address><email>ludovic.grossard@libertysurf.fr</email></address></affiliation><contrib>Mise à jour</contrib></othercredit>

source: This program is a clone of the well known game Tetris. You must fit the falling pieces to form full lines.
fr: Ce programme est un clone du célèbre jeu Tétris. Vous devez empiler les pièces qui tombent afin de former des lignes complètes.

source: game
fr: jeu

source: tetris
fr: tétris

source: This program is a clone of the well known game <command>Tetris</command>. You must fit the falling pieces to form full lines. You can rotate and translate the falling piece. The game ends when no more piece can fall ie when your incomplete lines reach the top of the board.
fr: Ce programme est un clone du célèbre jeu <command>Tétris</command>. Vous devez empiler les pièces qui tombent afin de former des lignes complètes. Vous pouvez faire tourner et translater les pièces tombantes. Le jeu prend fin lorsque plus aucune pièce ne peut tomber, c'est-à-dire lorsque vos lignes incomplètes atteignent le haut de l'écran de jeu.

source: Every time you have destroyed 10 lines, you gain a level and the pieces fall quicker (exactly the piece falls from a line each <literal>1/(1+level)</literal> second).
fr: À chaque fois que vous détruisez 10 lignes, vous accédez au niveau suivant et les pièces tombent plus rapidement (précisément la pièce tombe d'une ligne chaque <literal>1/(1+niveau)</literal> seconde).

source: How to play
fr: Comment jouer

source: Handling the falling piece
fr: Contrôler la pièce tombante

source: This game use keyboard to rotate, translate or drop down the falling piece. The keys are configurable with the menu item <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Key Bindings</guimenuitem></menuchoice>.
fr: Ce jeu utilise le clavier pour tourner, translater ou faire descendre rapidement la pièce tombante. Les touches sont configurables dans le menu <menuchoice><guimenu>Configuration</guimenu> <guimenuitem>Raccourcis clavier...</guimenuitem></menuchoice>.

source: How to gain points
fr: Comment gagner des points

source: There are two sources of points:
fr: Il y a deux façons de gagner des points&nbsp;:

source: Dropping down a piece gives a small amount of points which is equal to the drop height. It is not much each time but better than one can think perticularly in small levels (when the pieces fall slowly).
fr: Placer une pièce donne un petit montant de points qui est égal à la hauteur du lâcher. Ce n'est pas beaucoup à chaque fois, mais plus important qu'on ne peut le croire particulièrement dans les niveaux bas (quand les pièces tombent lentement).

source: The biggest part of the score comes from destroying full lines. It is very important to note that destroying multiple lines at the same time gives you much more points. A four-lines destruction is called a <emphasis>tetris</emphasis> : it gives a maximum amount of points.
fr: La partie la plus importante du score provient de la destruction des lignes complètes. Il est très important de noter que détruire plusieurs lignes en même temps vous donne plus de points. La destruction de quatre lignes est appelée un <emphasis>tétris</emphasis>&nbsp;: cela donne un montant maximum de points.

source: The points gained are 40 for a one-liner, 100 for two lines, 300 for three lines and 1200 for a tetris. These numbers must be multiplied by the current level. Destroying four lines in level 10 gives 12000 points !!
fr: Le nombre de points gagnés est 40 pour une ligne, 100 pour deux lignes, 300 pour trois lignes et 1200 pour un tétris. Ce nombre est multiplié par le niveau atteint. Détruire quatre lignes au niveau 10 donne 12000 points&nbsp;!

source: Options
fr: Configuration

source: Menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KSirtet</guimenuitem></menuchoice> opens the <guilabel>Settings</guilabel> Dialog.
fr: L'élément du menu <menuchoice><guimenu>Configuration</guimenu><guimenuitem>Configurer KSirtet...</guimenuitem></menuchoice> ouvre la boîte de dialogue de <guilabel>Configuration</guilabel>.

source: Show tile's shadow
fr: Afficher l'ombre des pièces

source: Shows/hides the shadow of the falling piece at the bottom of the board. This shadow can help to avoid position error when dropping the piece.
fr: Montre/cache l'ombre de la pièce tombante en bas de l'écran de jeu. Cette ombre peut aider à éviter les erreurs de positionnement quand on lâche la pièce.

source: Show next tile
fr: Afficher la pièce suivante

source: Shows/hides the display of the next piece to come.
fr: Montre/cache l'affichage de la pièce à venir.

source: Enable animations
fr: Activer les animations

source: Block Size
fr: Taille des blocs

source: Lets you change the size of the blocks (and increases the playing field to match. The default size is 15 (pixels.)
fr: Vous permet d'augmenter la taille des blocs (et augmente la zone de jeux. La valeur par défaut est 15 (pixels)).

source: Multiplayer
fr: Multijoueur

source: The multiplayer option allows to play with others players on the same computer or/and on different computers situated on the net. You can also play against an <acronym>AI</acronym> (artificial intelligence) player which is currently not very good.
fr: L'option multijoueur permet de jouer avec d'autres joueurs sur le même ordinateur ou/et avec d'autres ordinateurs sur l'internet. Vous pouvez aussi jouer contre un joueur <acronym>IA</acronym> (intelligence artificielle) qui n'est pour l'instant pas très fort.

source: Basically when destroying lines, a player sends garbage at the bottom of the game of his next opponent (nothing for a line desctroyed, one garbage line for two lines desctroyed and so on).
fr: Quand il détruit des lignes, un joueur les envoie en bas du jeu de son adversaire (rien pour une ligne détruite, une ligne pour deux lignes détruites et ainsi de suite).

source: Credits and Licenses
fr: Remerciements et licence

source: Developers
fr: Développeurs

source: <literal>Erik Eng</literal> - Wrote the generic tetris code
fr: <literal>Erik Eng</literal> - a écrit la plus grande part du code brut de tétris

source: Authors
fr: Auteurs

source: <literal><ulink url="mailto:rwilliams@kde.org">Robert Williams</ulink></literal> - Editor
fr: <literal><ulink url="mailto:rwilliams@kde.org">Robert Williams</ulink></literal> - éditeur

source: CREDIT_FOR_TRANSLATORS
fr: <para>Traduction française par Romain Quidet <email>rquidet@yahoo.com</email></para><para>Mise à jour de la traduction par Ludovic Grossard <email>ludovic.grossard@libertysurf.fr</email></para>
